<a href="https://colab.research.google.com/github/cevikhalil/Data-Science-with-Python-and-Tensorflow/blob/main/18_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

## Series

In [39]:
myDict = {"Daniel" : 23, "Emma" : 24, "Tom" :25}
pd.Series(myDict)

Daniel    23
Emma      24
Tom       25
dtype: int64

In [40]:
print("IMDB TOP250\n")
rating = pd.Series([9.2, 9.1,9.0],
                   ["The Shawshank Redemption:","The Godfather:","The Godfather II:"])
print(rating)

IMDB TOP250

The Shawshank Redemption:    9.2
The Godfather:               9.1
The Godfather II:            9.0
dtype: float64

## Data Frame

In [41]:
data = np.random.randn(4,3)
data

array([[-1.04166929,  0.46830796, -0.64495156],
       [ 0.35326441, -1.11781197,  1.47052813],
       [ 0.06128664,  0.64799403, -1.10629135],
       [-0.8279819 ,  0.45248397, -0.69240345]])

In [42]:
dataFrame = pd.DataFrame(data, 
                         index=["Mildred","John","Lea","Michel"],
                         columns=["Salary","Age","Profession"])
dataFrame

           Salary       Age  Profession
Mildred -1.041669  0.468308   -0.644952
John     0.353264 -1.117812    1.470528
Lea      0.061287  0.647994   -1.106291
Michel  -0.827982  0.452484   -0.692403

In [43]:
dataFrame[["Age","Profession"]]

              Age  Profession
Mildred  0.468308   -0.644952
John    -1.117812    1.470528
Lea      0.647994   -1.106291
Michel   0.452484   -0.692403

In [44]:
dataFrame.loc["Lea"]

Salary        0.061287
Age           0.647994
Profession   -1.106291
Name: Lea, dtype: float64

In [45]:
dataFrame["Location"] = "Kentucky"
dataFrame

           Salary       Age  Profession  Location
Mildred -1.041669  0.468308   -0.644952  Kentucky
John     0.353264 -1.117812    1.470528  Kentucky
Lea      0.061287  0.647994   -1.106291  Kentucky
Michel  -0.827982  0.452484   -0.692403  Kentucky

In [48]:
dataFrame.drop(['Profession'], axis=1)

           Salary       Age  Location
Mildred -1.041669  0.468308  Kentucky
John     0.353264 -1.117812  Kentucky
Lea      0.061287  0.647994  Kentucky
Michel  -0.827982  0.452484  Kentucky

In [53]:
dataFrame.drop(columns=['Location'])

           Salary       Age  Profession
Mildred -1.041669  0.468308   -0.644952
John     0.353264 -1.117812    1.470528
Lea      0.061287  0.647994   -1.106291
Michel  -0.827982  0.452484   -0.692403

In [56]:
dataFrame.loc["Lea"]

Salary        0.0612866
Age            0.647994
Profession     -1.10629
Location       Kentucky
Name: Lea, dtype: object

In [58]:
dataFrame.loc["Lea","Age"]

0.6479940320523023

## Operations

In [71]:
dictData = {"İstanbul" : [30,29,np.nan],
            "Ankara" : [20,np.nan,25],
            "İzmir" : [40,39,38]}
weatherDataFrame = pd.DataFrame(dictData)
weatherDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [74]:
weatherDataFrame.dropna() # drop NaN values (in rows)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [76]:
weatherDataFrame.dropna(axis=1) # drop NaN values (in columns)

   İzmir
0     40
1     39
2     38

In [78]:
newData = {"İstanbul" : [30,29,np.nan],
          "Ankara" : [20,np.nan,25],
           "İzmir" : [40,39,38],
           "Antalya" : [45,np.nan,np.nan]}
newDataFrame = pd.DataFrame(newData)
newDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [81]:
newDataFrame.dropna(axis=1, thresh=2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [85]:
newDataFrame.fillna(20)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [92]:
dictSalary = {"Department" : ["Software","Sales","Marketing","Finance","Human Resources", "Law"],
              "Employee" : ["Olivia","Sophia","Ethan","Oliver","William","Charlotte"],
              "Salary" : [100,150,200,300,400,500]}
salaryDataFrame = pd.DataFrame(dictSalary)
salaryDataFrame

        Department   Employee  Salary
0         Software     Olivia     100
1            Sales     Sophia     150
2        Marketing      Ethan     200
3          Finance     Oliver     300
4  Human Resources    William     400
5              Law  Charlotte     500

In [93]:
dictSalary = {"Department" : ["Software","Software","Marketing","Marketing","Law", "Law"],
              "Employee" : ["Olivia","Sophia","Ethan","Oliver","William","Charlotte"],
              "Salary" : [100,150,200,300,400,500]}
salaryDataFrame = pd.DataFrame(dictSalary)
salaryDataFrame

  Department   Employee  Salary
0   Software     Olivia     100
1   Software     Sophia     150
2  Marketing      Ethan     200
3  Marketing     Oliver     300
4        Law    William     400
5        Law  Charlotte     500

In [97]:
groupObject = salaryDataFrame.groupby("Department")
groupObject.count()

            Employee  Salary
Department
Law                2       2
Marketing          2       2
Software           2       2

In [98]:
groupObject.mean()

            Salary
Department
Law            450
Marketing      250
Software       125

In [99]:
groupObject.min()

             Employee  Salary
Department
Law         Charlotte     400
Marketing       Ethan     200
Software       Olivia     100

In [100]:
groupObject.max()

           Employee  Salary
Department
Law         William     500
Marketing    Oliver     300
Software     Sophia     150

In [102]:
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Law           2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Marketing     2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Software      2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concatenate

In [106]:
dict1 = {"Name" : ["Carrie","Samantha","Charlotte","Miranda"],
         "Sport" : ["Running","Swimming","Running","Basketball"],
         "Calorie" : [100,200,300,400]}
dataFrame1 = pd.DataFrame(dict1, index = [0,1,2,3])
dataFrame1

        Name       Sport  Calorie
0     Carrie     Running      100
1   Samantha    Swimming      200
2  Charlotte     Running      300
3    Miranda  Basketball      400

In [110]:
dict2 = {"Name" : ["Isabella","Emma","Noah","Liam"],
         "Sport" : ["Running","Swimming","Running","Basketball"],
         "Calorie" : [200,100,50,300]}
dataFrame2 = pd.DataFrame(dict2, index = [4,5,6,7])
dataFrame2

       Name       Sport  Calorie
4  Isabella     Running      200
5      Emma    Swimming      100
6      Noah     Running       50
7      Liam  Basketball      300

In [111]:
dict3 = {"Name" : ["Lucas","Harper","Mason","Ava"],
         "Sport" : ["Running","Swimming","Badminton","Tennis"],
         "Calorie" : [300,400,500,250]}
dataFrame3 = pd.DataFrame(dict3, index = [8,9,10,11])
dataFrame3

      Name      Sport  Calorie
8    Lucas    Running      300
9   Harper   Swimming      400
10   Mason  Badminton      500
11     Ava     Tennis      250

In [113]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

         Name       Sport  Calorie
0      Carrie     Running      100
1    Samantha    Swimming      200
2   Charlotte     Running      300
3     Miranda  Basketball      400
4    Isabella     Running      200
5        Emma    Swimming      100
6        Noah     Running       50
7        Liam  Basketball      300
8       Lucas     Running      300
9      Harper    Swimming      400
10      Mason   Badminton      500
11        Ava      Tennis      250

## Merge

In [3]:
mergeDict1 = {"Name" : ["Carrie","Samantha","Charlotte","Miranda"],
         "Sport" : ["Running","Swimming","Running","Basketball"]}
mergeDataFrame1 = pd.DataFrame(mergeDict1, index = [0,1,2,3])
mergeDataFrame1

        Name       Sport
0     Carrie     Running
1   Samantha    Swimming
2  Charlotte     Running
3    Miranda  Basketball

In [7]:
mergeDict2 = {"Name" : ["Carrie","Samantha","Charlotte","Miranda"],
              "Calorie" : [100,200,150,200]}
mergeDataFrame2 = pd.DataFrame(mergeDict2, index = [0,1,2,3])
mergeDataFrame2

        Name  Calorie
0     Carrie      100
1   Samantha      200
2  Charlotte      150
3    Miranda      200

In [8]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Name")

        Name       Sport  Calorie
0     Carrie     Running      100
1   Samantha    Swimming      200
2  Charlotte     Running      150
3    Miranda  Basketball      200

## Advanced Operations

In [20]:
dict1 = {"Name" : ["Carrie","Samantha","Charlotte","Miranda"],
         "Department" : ["Software","Sales","Marketing","Software"],
         "Salary" : [2000,3000,4000,5000]}
salaryDataFrame = pd.DataFrame(dict1, index = [0,1,2,3])
salaryDataFrame

        Name Department  Salary
0     Carrie   Software    2000
1   Samantha      Sales    3000
2  Charlotte  Marketing    4000
3    Miranda   Software    5000

In [13]:
salaryDataFrame["Department"].unique()

array(['Software', 'Sales', 'Marketing'], dtype=object)

In [15]:
salaryDataFrame["Department"].nunique() # number of unique

3

In [21]:
salaryDataFrame["Department"].value_counts()

Software     2
Marketing    1
Sales        1
Name: Department, dtype: int64

In [22]:
def netSalary(salary):
  return salary * 0.66

In [23]:
salaryDataFrame["Salary"].apply(netSalary) # apply function to data frame

0    1320.0
1    1980.0
2    2640.0
3    3300.0
Name: Salary, dtype: float64

## Working with Excel file

In [ ]:
import pandas as pd
dataFrame = pd.read_excel("salary.xlsx") # read excel file